//-----------------------------------------------------include 
#include <stdio.h>
#include <string.h>
#include <stdlib.h>



//-----------------------------------------------------Main 함수
int main(){
    //-------------------------------------------------카메라 데이터를 컴퓨터로 통신 (차선,신호등,장애물)

    //-------------------------------------------------화면에 네비게이션 표시

    //------------------------------------------------- 도로 차선에 따라 구분함수

    //어린이 보호 구역 진입 시

    //모터속도 감속함수, 
    
    //모터ON함수 , 
    
    //신호에 따라 함수호출, 
    
    //모터 기울기 함수
    
    //-------------------------------------------------자동차 모듈과 통신
    
}